In [1]:
import numpy as np
import pandas as pd
import random as random

In [2]:
ratings = pd.read_csv(r'C:\Users\nisar\Downloads\ADMProj\ratings.csv')

In [9]:

ratings['date']=np.random.choice(pd.date_range('2015-01-01', '2019-01-01'), len(ratings))

In [10]:
ratings.head()

   book_id  user_id  rating       date
0        1      314       5 2018-05-18
1        1      439       3 2015-07-18
2        1      588       5 2016-10-30
3        1     1169       4 2015-08-28
4        1     1185       4 2017-06-23

In [11]:
ratings['price']=np.random.randint(50, 500, ratings.shape[0])

In [12]:
ratings.head()

   book_id  user_id  rating       date  price
0        1      314       5 2018-05-18    191
1        1      439       3 2015-07-18    242
2        1      588       5 2016-10-30    282
3        1     1169       4 2015-08-28    378
4        1     1185       4 2017-06-23    131

In [18]:
ratings['transaction_type']=np.random.choice(['sample', 'ordered'], size=len(ratings), p=[0.15, 0.85])

In [16]:
# ratings=ratings.drop('transaction_type', axis = 1)

In [19]:
ratings.head()

   book_id  user_id  rating       date  price transaction_type
0        1      314       5 2018-05-18    191          ordered
1        1      439       3 2015-07-18    242          ordered
2        1      588       5 2016-10-30    282          ordered
3        1     1169       4 2015-08-28    378           sample
4        1     1185       4 2017-06-23    131          ordered

In [21]:
ratings=ratings.drop('rating', axis = 1)

In [23]:
ratings.head()

   book_id  user_id       date  price transaction_type
0        1      314 2018-05-18    191          ordered
1        1      439 2015-07-18    242          ordered
2        1      588 2016-10-30    282          ordered
3        1     1169 2015-08-28    378           sample
4        1     1185 2017-06-23    131          ordered

In [24]:
ratings.to_csv('CohardAnalysisData.csv')